{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ryan Hefner | All | RSS Feed",
    "home_page_url": "https://",
    "feed_url": "https:///feeds/all/rss.json",
    "description": "Welcome to this blog posts!",
    "icon": "https:///assets/ryan-hefner-social.jpg",
    "items": [
        {
            "id": "https:///thoughts/year-in-review-2023",
            "content_html": "<h1>2023 Year In Review</h1>\n<h2>Doing</h2>\n<h2>Thinking</h2>\n<h2>Growing</h2>\n<h2>Preparing</h2>\n<h2>Highlights</h2>\n<h3>January</h3>\n<h3>February</h3>",
            "url": "https:///thoughts/year-in-review-2023",
            "title": "2023 Year In Review",
            "summary": "A look back at the year 2023.",
            "date_modified": "2023-12-31T05:00:00.000Z"
        },
        {
            "id": "https:///thoughts/streamlining-my-publishing-workflow-part-1",
            "content_html": "<h1>Streamlining My Publishing Workflow</h1>\n<p>Part 1 of 3 in a series on how I streamlined my publishing workflow with Obsidian, GitHub, and NextJS + Contentlayer + Vercel.</p>\n<p>In this series, I document how I settled on my writing tool of choice, the\ncriteria and exploration in the various tools I tried, and the final setup I\nlanded on for making publishing content to this site something I will actually\ndo, and enjoy it.</p>\n<h2>Settling on the Source</h2>\n<p>You know the classic story, you want to do something, but you have a lot of\npriorities that need to be met to do the thing they way you want to. These\npriorities amount to a lot of work, figuring things out, and you might not be\nable to ultimately pull it off. Or you think can pull it off, but it might\nrequire more time and effort than the thing is actually worth. That’s where I\nwas for a while when it comes to adding some dynamic sections to this site,\nuntil today.</p>\n<p>I think I have finally configured the ultimate way for me to publish content to\nthis site that aligns with my personal workflow of writing and managing ideas.</p>\n<h2>Looking Back</h2>\n<p>Over the years, I have tried a lot of different ways to publish content to my\npersonal sites. The majority were a quickly hacked together CMS that relied on\na database and some rough admin system that would allow me to log in and access\nsome basic forms to publish/edit content.</p>\n<p>I have also tried a few different static site generators, including Jekyll,</p>\n<h2>Moving Forward</h2>\n<h3>Must haves</h3>\n<ol>\n<li>Write and publish from the same place I take notes/write documents.</li>\n<li>One-click publish to site from writing app.</li>\n<li>Ability to publish to multiple areas of the site from a single workflow.</li>\n</ol>\n<h3>Nice to haves</h3>\n<ol>\n<li>Support for tagging content and making tags discoverable.</li>\n<li>Ability to use <a href=\"https://www.linkcards.io\">LinkCards</a> for <code>og:image</code> handling.</li>\n<li>Ability to use <a href=\"https://www.pkgstats.com/pkg:next-meta\"><code>next-meta</code></a> for all Open Graph tags.</li>\n</ol>\n<h2>Explorations</h2>\n<ul>\n<li>Native NextJS/MDX rendering</li>\n<li>Contentlayer</li>\n</ul>\n<h3>Native NextJS/MDX rendering</h3>\n<h4>The Goods</h4>\n<h4>The Bads</h4>\n<h4>The Uglies</h4>\n<pre><code class=\"language-js\">const text = 'Here is some text with JS code style applied to it'\n\nconst moreText = 'Here is some more text with JS code style applied to it'\n\nconst aNumber = 2023 // To make sure this is rendering the proper font\n</code></pre>\n<h3>Contentlayer</h3>\n<h4>The Goods</h4>\n<h4>The Bads</h4>\n<h4>The Uglies</h4>",
            "url": "https:///thoughts/streamlining-my-publishing-workflow-part-1",
            "title": "Streamlining My Publishing Workflow: Part 1 - The Origin",
            "summary": "How I streamlined my publishing workflow with Obsidian, GitHub and NextJS + Contentlayer + Vercel.",
            "date_modified": "2023-12-28T05:00:00.000Z"
        },
        {
            "id": "https:///now/2023-03-17",
            "content_html": "<h2>New library release: <a href=\"https://www.pkgstats.com/pkg:react-marquease\">react-marquease</a></h2>\n<p>I have been working on a new library that I am really excited about. This one has been in the works for a while, and has actually had a couple versions over the years. I am not sure why it took me so long to get this out, but I have a vanila JS version, as well as a React Class version, but this is the one that I wanted to release, and actually uses the least amount of code amongst the three.</p>\n<p>The library is called, <code>react-marquease</code>, and it’s pretty much what it is called, an easy way to add a <code>&#x3C;marquee></code>-like component to your React application.</p>\n<p>I have already used it in both the communal.works site, and even in the sub-<code>&#x3C;footer></code> on this site (just scroll down).</p>\n<p>I have a few more updates I plan on making to it, but it should be ready for normal use, and I plan on throwing this one on a bunch of sites.</p>\n<h2>New project / collaboration: communal.works</h2>\n<p>I have been working on a new project with a friend of mine, Jon Black. We have been exploring what a community of like-minded and socially conscience people coming together to help each other, and potentially collaborate on projects, or consulting opportunities, would look like.</p>\n<ul>\n<li>How would it operate?</li>\n<li>What system or tools could be setup to help facilitate collaboration and efficiency?</li>\n<li>How would the community grow and self-regulate?</li>\n</ul>\n<p>These are just a few of the questions we have been trying to put answers to. And, in the meantime we threw up a quick site where we can start answering those and defining what communal.works is.</p>\n<h2>Site updates</h2>\n<p>After launching this new version of the site back in August of last year, I haven’t done many updates to it. But, over the last couple of weeks I have had a few things in motion that seemed like it warranted some updates to be made.</p>\n<p>With that said, here are a few of the updates I’ve made over the last week:</p>\n<ul>\n<li>Add <a href=\"https://www.casters.io\">Casters</a>[^1] 1 to home and projects pages.</li>\n<li>Add new w/ OSS (with open-source software) page.[^2]</li>\n<li>Obviously, this is new /now page, and with that I have created an archive of previous /now pages. You can find a link to the previous below.</li>\n<li>I have been really happy with using Fathom on this site for analytics. I realized that I may not have had it fully integrated properly, and after reviewing the docs in the library I used to integrate it with, fathom-client, I realized they have a new documentation on how to set it up. So, that was updated, which is nice.</li>\n</ul>\n<h2>Personal goals</h2>\n<ul>\n<li>Save weekends for kids: ✅</li>\n<li>Get final home renovations projects done, so we can move in: ✅</li>\n<li>~~Daily trail run (weekdays)~~</li>\n<li>~~Daily rowing session (weekdays)~~</li>\n<li>Daily Peloton session[^3] (at least weekdays, ideally all days)</li>\n</ul>\n<p>[^1]: Casters – This is a new project I am working on. I think it’s going to be really cool, and useful, but not ready to get into all of that here/now. Expect more updates on this over the coming weeks/months.\n[^2]: w/ OSS page – This is a concept that I like and will probably be expanding on more. Don’t be surprised if some more projects spin out of this idea.\n[^3]: Daily Peloton session – Unfortunately, once we moved into our house, I had to relocate the rowing machine to a space that makes it inconvenient to use. So, luckily we also picked up a Peloton bike, and that is now my goto for exercise.</p>",
            "url": "https:///now/2023-03-17",
            "title": "Spring is in the air",
            "summary": "A new library release, a new project, and a few site updates.",
            "date_modified": "2023-03-17T04:00:00.000Z"
        },
        {
            "id": "https:///now/2022-08-03",
            "content_html": "<h2>Create/updating this site</h2>\n<p>I made the mistake of building my last portfolio in a technology that I didn’t have the time to keep up and maintain. This version is way more stripped down, although should be generally easier to maintain as well, as I continue to build this out and flesh out more areas/information to add.</p>\n<p>I will be posting more here as new updates make it to the site.</p>\n<h2>Shiny new product: <a href=\"https://www.pregraph.com\">Pregraph</a></h2>\n<p>After working across several apps that have all either implemented—or are utilizing—GraphQL APIs, I have come across some common issues/areas that could be added to make them easier to analyze, optimize, and expand.</p>\n<p>The first tool to get the gears flowing was releasing a general purpose Apollo Link, <a href=\"https://github.com/pregraph/apollo-link-performance\">apollo-link-performance</a>, for logging GraphQL API requests to your current analytics service. With more features to make their way into that link shortly.</p>\n<h2>Personal goals</h2>\n<ul>\n<li>Save weekends for kids</li>\n<li>Get final home renovations projects done, so we can move in</li>\n<li>Daily trail run (weekdays)</li>\n<li>Daily rowing session (weekdays)</li>\n</ul>",
            "url": "https:///now/2022-08-03",
            "title": "First post",
            "summary": "New site, new project, and current goals.",
            "date_modified": "2022-08-03T04:00:00.000Z"
        }
    ]
}